{
    "glass_shard": {
        "name": "Glass Shard",
        "description": "A fragment of crystallized time. Cuts that which moves out of rhythm.",
        "category": "material",
        "effect": null,
        "icon": "polygon"
    },
    "vial_liquid_seconds": {
        "name": "Vial of Liquid Seconds",
        "description": "A small glass vial containing a golden, viscous fluid that twitches on its own. \"The rich drank time like wine, believing it would keep their glass skins from growing dull. They did not know that hoarding time leaves none for the rest of the world. It tastes of copper and regret.\"",
        "category": "consumable",
        "effect": {
            "type": "heal",
            "value": 50
        },
        "icon": "vial"
    },
    "shard_of_panic": {
        "name": "Shard of Panic",
        "description": "A jagged splinter of red crystal that vibrates violently in the hand. \"Adrenaline crystallized into a solid state. Use it to borrow speed from your future self. Just remember that the debt must eventually be paid.\"",
        "category": "consumable",
        "effect": {
            "type": "speed_boost",
            "duration": 10,
            "value": 1.5
        },
        "icon": "shard_red"
    },
    "bottled_silence": {
        "name": "Bottled Silence",
        "description": "A heavy lead jar that seems to weigh nothing at all. Opening it releases a total absence of sound. \"Harvested from the deepest vaults of the Hushed Halls. For a moment, you do not exist, for existence is a vibration, and you have ceased to hum.\"",
        "category": "consumable",
        "effect": {
            "type": "stealth",
            "duration": 15
        },
        "icon": "jar_dark"
    },
    "stopped_watch": {
        "name": "The Stopped Watch",
        "description": "A heavy brass pocket watch with hands fused to the face at 11:59. \"A keepsake of the Chief Engineer. It is said he stared at this watch for so long he forgot to wind the heavy heart of the world. Or perhaps, he chose not to.\"",
        "category": "key",
        "effect": null,
        "icon": "watch"
    },
    "rusty_key_hand": {
        "name": "The Rusty Key-Hand",
        "description": "The severed hand of a disposal unit, joints fused by oxidation. Even in death, it clutches its charge with mechanical devotion. The Architects built the Maintenance Doors to hide the grinding noise of the undercity from the glass gardens above. This hand is the only thing that remembers how to open them.",
        "category": "key",
        "effect": {
            "type": "unlock",
            "target": "maintenance_doors"
        },
        "icon": "key"
    },
    "breath_of_creator": {
        "name": "Breath of the Creator",
        "description": "The crystallized final breath of the Glass-Blower Deity. It is warm and smells of molten sand. He gave his breath to make his children beautiful, but he had no breath left to tell them they were fragile.",
        "category": "boss_soul",
        "effect": {
            "type": "unlock_spell",
            "spell": "glass_form"
        },
        "icon": "breath"
    },
    "tuning_fork_spear": {
        "name": "Tuning Fork Spear",
        "description": "A heavy iron partisan, forged with a bifurcated tip. The Silence Guard did not carry these to kill, but to 'correct.' When struck against a dissonant soul, the prongs vibrate with such violence that the victim's bones are pulverized into silence. It does not cut the flesh; it shatters the song within.",
        "category": "weapon",
        "effect": {
            "type": "equip",
            "damage": 40,
            "resonance_gain": 5
        },
        "icon": "sword"
    },
    "cracked_mirror": {
        "name": "A Cracked Mirror",
        "description": "A shard of glass that reflects the smog and the steel, but not you. Only a hollow ache remains where your image should be. Proof that in this machine, you are not the operator, but the ghost.",
        "category": "narrative",
        "effect": null,
        "icon": "mirror"
    },
    "foremans_ledger": {
        "name": "Foreman's Ledger",
        "description": "A log of 'Soft Units' marked for the furnace. The final entry is stamped 12:00:00, repeated until the ink ran dry. It documents the exact second the world decided that breathing was inefficient.",
        "category": "narrative",
        "effect": null,
        "icon": "book"
    },
    "oxidized_whistle": {
        "name": "Oxidized Whistle",
        "description": "A dog whistle made of rusted iron. It makes no sound when blown, but the rust on nearby metal begins to flake off. \"The scavengers used these to call the beast, feeding it scrap to keep it from eating them. It answers only to the song of decay.\"",
        "category": "key",
        "effect": {
            "type": "trigger_event",
            "event": "summon_rust_dragon"
        },
        "icon": "whistle"
    },
    "scale_of_decay": {
        "name": "Scale of Decay",
        "description": "A massive, flaking scale that smells of wet iron. It is warm to the touch. \"Entropy is not a mistake; it is the universe breathing out. This scale proves that even the end can be beautiful.\"",
        "category": "key",
        "effect": null,
        "icon": "scale"
    },
    "mannequin_eye": {
        "name": "Mannequin's Glass Eye",
        "description": "A perfectly spherical glass eye, weeping a constant stream of oil. \"The prototypes were discarded because they could not stop crying. The Architects deemed 'sorrow' a flaw in the manufacturing process, rather than a reasonable reaction to existence.\"",
        "category": "narrative",
        "effect": null,
        "icon": "eye"
    },
    "perfect_prism": {
        "name": "Perfect Prism",
        "description": "A geometric impossibility. A prism that reflects light that isn't there. \"Vitria demanded perfection. When this prism was cut, it was so flawless that it became jealous of its own reflection. It yearns to be broken.\"",
        "category": "key",
        "effect": {
            "type": "trigger_event",
            "event": "summon_mirror_knight"
        },
        "icon": "prism"
    },
    "shard_of_narcissus": {
        "name": "Shard of Narcissus",
        "description": "A mirror shard that shows the viewer's face, but older and wiser. \"Vanity freezes time. To love oneself is to refuse to change. To hold this shard is to accept that you are not who you were yesterday.\"",
        "category": "key",
        "effect": null,
        "icon": "shard"
    },
    "spring_of_eternity": {
        "name": "Spring of Eternity",
        "description": "A mainspring that never unwinds. It holds infinite tension. \"The machine wanted to run forever. It didn't understand that a song that never ends is just noise. This spring represents the courage to stop.\"",
        "category": "key",
        "effect": null,
        "icon": "spring"
    },
    "velvet_throat": {
        "name": "Velvet Throat",
        "description": "A fleshy, preserved vocal cord wrapped in silk. It hums a low, sad note. \"The voice of the void. It does not scream; it whispers the truth that the Conductor tried to hide: The song was always meant to end.\"",
        "category": "key",
        "effect": null,
        "icon": "flesh"
    },
    "gag_of_the_saint": {
        "name": "The Gag of the Saint",
        "description": "A strip of cloth woven from pure void. It absorbs all light around it. \"Used to silence the First Prophet who tried to warn the world about the Conductor. The monks sew their own mouths shut in imitation, terrified that speaking the truth will summon the Static.\"",
        "category": "narrative",
        "effect": null,
        "icon": "cloth"
    },
    "generals_log": {
        "name": "General's Log: Entry 404",
        "description": "\"We locked the door not to keep them out, but to keep Him in. The Conductor's song... it doesn't end. It just gets louder.\"",
        "category": "narrative",
        "effect": null,
        "icon": "scroll"
    },
    "sheet_music_fragment": {
        "name": "Sheet Music Fragment",
        "description": "A torn page of the score, notes written in blood and oil. It ends abruptly at the 13th measure. The ink is still wet, as if the composer was interrupted by a realization too terrible to write down.",
        "category": "narrative",
        "effect": null,
        "icon": "paper"
    },
    "calcified_tuning_peg": {
        "name": "Calcified Tuning Peg",
        "description": "A rusted iron peg, fused to a lump of bone. \"Before the Carillon, there were smaller instruments. They were discarded not because they were broken, but because they could not play the Conductor's new scale. This one still hums in the key of G-Minor.\"",
        "category": "narrative",
        "effect": null,
        "icon": "peg"
    },
    "glass_handkerchief": {
        "name": "Glass Handkerchief",
        "description": "A square of spun glass, impossibly thin and flexible. \"The nobility used these to wipe away tears. However, glass does not absorb moisture; it only smears it across the face. A cruel design for a people who were forbidden to be unhappy.\"",
        "category": "narrative",
        "effect": null,
        "icon": "cloth"
    },
    "punch_card_of_the_late": {
        "name": "Punch-Card of the Late",
        "description": "A brass card with a single error punched into the timeline. \"Worker Unit 734 missed a beat by 0.04 seconds. The error was logged, the unit was melted down, and the metal was reused to make this card. Efficiency is a circle.\"",
        "category": "narrative",
        "effect": null,
        "icon": "card"
    },
    "jar_of_stifled_laughter": {
        "name": "Jar of Stifled Laughter",
        "description": "A small, vacuum-sealed jar. It vibrates slightly. \"The Silent Choir believes that joy is the loudest noise of all. They captured this sound from a child before sewing his mouth shut. If you shake it, it sounds like weeping.\"",
        "category": "narrative",
        "effect": null,
        "icon": "jar_light"
    },
    "glitch_dust": {
        "name": "Glitch-Dust",
        "description": "A handful of white powder that flickers in and out of existence. \"Matter that cannot decide if it is real. Snorting it grants a brief vision of a world without crystal, where the sky is blue instead of white static. The user usually wakes up screaming.\"",
        "category": "narrative",
        "effect": null,
        "icon": "powder"
    },
    "lens_of_gatekeeper": {
        "name": "Lens of the Gatekeeper",
        "description": "A perfectly clear lens that hurts to look at. \"He was the first line of defense for a lie. He blinded the world so they would not see that the heaven they marched toward was empty.\"",
        "category": "boss_soul",
        "effect": {
            "type": "unlock_ability",
            "ability": "flashbang"
        },
        "icon": "gatekeeper_lens"
    },
    "industrial_gear": {
        "name": "Industrial Gear",
        "description": "A heavy iron gear, teeth worn smooth by centuries of grinding. It was once part of the Great Clock's heartbeat. Now, it lies silent, a testament to a time when the world moved forward instead of in circles.",
        "category": "narrative",
        "effect": null,
        "icon": "gear"
    },
    "compacted_junk": {
        "name": "Compacted Junk",
        "description": "A dense cube of refuse, crushed into a solid mass. It contains everything from broken toys to discarded limbs. In the Scrapyard, nothing is ever truly lost; it is merely compressed until it fits.",
        "category": "narrative",
        "effect": null,
        "icon": "junk"
    },
    "heavy_chain_link": {
        "name": "Heavy Chain-Link",
        "description": "A single link of a chain thick enough to anchor a ship. The metal is cold and smells of dried blood. It once held something massive in place, something that did not want to be held.",
        "category": "narrative",
        "effect": null,
        "icon": "chain"
    },
    "hollow_book_spine": {
        "name": "Spine of a Living Book",
        "description": "The leather binding of a tome that bites back. It is warm, pulsing with a slow, rhythmic heartbeat. \"Archivist Pellinore did not trust locks to guard the forbidden section. She bred these monstrosities to digest the curious. In the Hushed Halls, reading is not just forbidden; it is part of the food chain.\"",
        "category": "narrative",
        "effect": null,
        "icon": "book_spine"
    },
    "crystal_shard_spire": {
        "name": "Shard of a Broken Second",
        "description": "A fragment of a Crystal Shard, vibrating with the memory of a second that never finished ticking. \"The Belfry is not built of stone, but of solidified time. These creatures are not alive; they are merely moments that refused to pass, violently defending their right to exist.\"",
        "category": "narrative",
        "effect": null,
        "icon": "crystal_spire"
    },
    "marble_fragment": {
        "name": "Marble Fragment",
        "description": "A chip of white marble from a grand pillar. It is cool to the touch. The Architects built their temples to last forever, forgetting that even stone must bow to the weight of entropy.",
        "category": "narrative",
        "effect": null,
        "icon": "marble"
    },
    "cube_of_compacted_regret": {
        "name": "Cube of Compacted Regret",
        "description": "A dense, heavy cube of scrap metal, weighing as much as a man. \"The Trash-Compactor believed that compression was a form of healing—that by forcing the broken pieces together, they would become whole again. It never learned that a crushed flower is not a seed.\"",
        "category": "boss_soul",
        "effect": {
            "type": "unlock_ability",
            "ability": "heavy_slam"
        },
        "icon": "junk"
    },
    "valve_of_marshal": {
        "name": "Valve of the Marshal",
        "description": "A heavy brass valve, rusted shut in the 'Closed' position. \"The Steam-Marshal believed that pressure was the only virtue; that to vent was to bleed. He held the world's breath until his own lungs burst.\"",
        "category": "boss_soul",
        "effect": {
            "type": "unlock_ability",
            "ability": "steam_vent"
        },
        "icon": "gear"
    },
    "quill_of_archivist": {
        "name": "Quill of the Archivist",
        "description": "A feather quill made of bone, the tip stained with dry, black ink. \"She wrote the history of the world in invisible ink, ensuring the weight of the truth would not crush the reader. She silenced the books not out of malice, but because she knew that some stories, if read aloud, would scream.\"",
        "category": "boss_soul",
        "effect": {
            "type": "unlock_spell",
            "spell": "silence_glyph"
        },
        "icon": "quill_archivist"
    },
    "wireframe_apple": {
        "name": "Wireframe Apple",
        "description": "A fruit composed of nothing but edges, humming with the faint sound of a tuning fork. It casts no shadow and has no scent. \"It fell from the Blueprint Tree, before the Creator sang the flesh onto the bone. It is the ghost of a meal that never was.\"",
        "category": "consumable",
        "effect": {
            "type": "heal",
            "value": 15
        },
        "icon": "apple"
    },
    "null_texture_sample": {
        "name": "Null Texture Sample",
        "description": "A scrap of cloth that possesses no color, only a maddening pattern of absence. \"The weavers claim this is not a fabric, but a hole in the tapestry where the thread ran out. To look at it is to see the nothingness that lies behind the song.\"",
        "category": "narrative",
        "effect": null,
        "icon": "cloth"
    },
    "pixelated_tear": {
        "name": "Pixelated Tear",
        "description": "A teardrop hardened into crude, square crystals. It cuts the hand that holds it. \"When the world unravels, even sadness loses its curve. This is grief stripped of its grace, left as raw, jagged form.\"",
        "category": "narrative",
        "effect": null,
        "icon": "tear"
    },
    "metronome_oil": {
        "name": "Metronome Oil",
        "description": "A flask of thick, black lubricant that smells of burnt chicory and ozone. \"The Gear-Keepers drink this to stay awake. It keeps their internal pendulums swinging without friction. Warning: Highly addictive to anyone with a heartbeat.\"",
        "category": "narrative",
        "effect": null,
        "icon": "jar_dark"
    },
    "opaque_mirror": {
        "name": "Opaque Mirror",
        "description": "A hand mirror that has been coated in light-drinking lacquer. \"A scandalous contraband item. To own a mirror that does not reflect is to deny one's existence. It was likely used by a Glazewright who wanted, just for a moment, to be unseen.\"",
        "category": "narrative",
        "effect": null,
        "icon": "mirror"
    },
    "velvet_ear_plugs": {
        "name": "Velvet Ear-Plugs",
        "description": "Two small plugs of compressed velvet and wax. \"Standard issue for the initiates. Before they are ready to sew their mouths shut, they must first learn to stop listening to the world's lies. It blocks out everything but the sound of your own blood.\"",
        "category": "narrative",
        "effect": null,
        "icon": "cloth"
    }
}
