{
    "glass_shard": {
        "name": "Glass Shard",
        "description": "A fragment of crystallized time. Cuts that which moves out of rhythm.",
        "category": "material",
        "effect": null,
        "icon": "polygon"
    },
    "vial_liquid_seconds": {
        "name": "Vial of Liquid Seconds",
        "description": "A golden, twitching fluid. The rich drank time like wine, believing it would keep their glass skins from growing dull.",
        "category": "consumable",
        "effect": {
            "type": "heal",
            "value": 50
        },
        "icon": "vial"
    },
    "stopped_watch": {
        "name": "The Stopped Watch",
        "description": "A pocket watch with hands fused to the face. It pulses with a phantom weight, heavier than lead. The Architect did not lose it; they left it behind when time became a burden.",
        "category": "key",
        "effect": null,
        "icon": "watch"
    },
    "rusty_key_hand": {
        "name": "The Rusty Key-Hand",
        "description": "The severed hand of a disposal unit, joints fused by oxidation. Even in death, it clutches its charge with mechanical devotion. It opens the Maintenance Doors, which were sealed to keep the grinding noise of the undercity from reaching the glass gardens above.",
        "category": "key",
        "effect": {
            "type": "unlock",
            "target": "maintenance_doors"
        },
        "icon": "key"
    },
    "breath_of_creator": {
        "name": "Breath of the Creator",
        "description": "He gave his breath to make them beautiful, but he had no breath left to tell them they were fragile.",
        "category": "boss_soul",
        "effect": {
            "type": "unlock_spell",
            "spell": "glass_form"
        },
        "icon": "breath"
    },
    "tuning_fork_spear": {
        "name": "Tuning Fork Spear",
        "description": "A massive, two-pronged spear made of heavy iron. It hums with a low, headache-inducing frequency. Standard issue for the Silence Guard, used to skewer dissonance.",
        "category": "weapon",
        "effect": {
            "type": "equip",
            "damage": 40,
            "resonance_gain": 5
        },
        "icon": "sword"
    },
    "cracked_mirror": {
        "name": "A Cracked Mirror",
        "description": "The glass reflects the smog and the steel, but your face is absent. Only a hollow ache remains where your image should be. Proof that you are a ghost in this machine.",
        "category": "narrative",
        "effect": null,
        "icon": "mirror"
    },
    "foremans_ledger": {
        "name": "Foreman's Ledger",
        "description": "A log of 'Soft Units' marked for the furnace. The final entry is stamped 12:00:00, repeated until the ink ran dry. The exact second the world decided to stop breathing.",
        "category": "narrative",
        "effect": null,
        "icon": "book"
    },
    "oxidized_whistle": {
        "name": "Oxidized Whistle",
        "description": "A crude copper flute, choked with verdigris. The discarded prototypes of the Scrapyard blew into it until their glass lungs shattered, praying for the Prime Conductor to reclaim them. They sought a shepherd, but their dissonance summoned a wolf. The frequency resonates with nothing but decay.",
        "category": "key",
        "effect": {
            "type": "trigger_event",
            "event": "summon_rust_dragon"
        },
        "icon": "whistle"
    },
    "scale_of_decay": {
        "name": "Scale of Decay",
        "description": "A flake of iron, warm and feverish to the touch. It sheds endlessly from a beast that rejects the stasis of the glass world. In a land of eternal preservation, 'aging' is a heresy—and this scale is its scripture. Proof that even the crystal must eventually turn to dust.",
        "category": "key",
        "effect": null,
        "icon": "scale"
    },
    "mannequin_eye": {
        "name": "Mannequin's Glass Eye",
        "description": "An imperfect sphere of cloudy glass. It was plucked from a prototype body that was deemed 'too human' for the gardens above. It has seen the bottom of the world, and in the darkness, it learned to weep.",
        "category": "narrative",
        "effect": null,
        "icon": "eye"
    },
    "perfect_prism": {
        "name": "Perfect Prism",
        "description": "A geometric impossibility. Light enters it but never leaves, bouncing internally forever.",
        "category": "key",
        "effect": {
            "type": "trigger_event",
            "event": "summon_mirror_knight"
        },
        "icon": "prism"
    },
    "shard_of_narcissus": {
        "name": "Shard of Narcissus",
        "description": "A piece of a mirror that reflects your true self... or perhaps the self you wish you were.",
        "category": "key",
        "effect": null,
        "icon": "shard"
    },
    "generals_log": {
        "name": "General's Log: Entry 404",
        "description": "'We locked the door not to keep them out, but to keep Him in. The Conductor's song... it doesn't end. It just gets louder.'",
        "category": "narrative",
        "effect": null,
        "icon": "scroll"
    },
    "sheet_music_fragment": {
        "name": "Sheet Music Fragment",
        "description": "A torn page of the score. The notes are written in blood and oil. It ends abruptly at the 13th measure.",
        "category": "narrative",
        "effect": null,
        "icon": "paper"
    }
}
