{
    "glass_shard": {
        "name": "Glass Shard",
        "description": "A fragment of crystallized time. Cuts that which moves out of rhythm.",
        "category": "material",
        "effect": null,
        "icon": "polygon"
    },
    "vial_liquid_seconds": {
        "name": "Vial of Liquid Seconds",
        "description": "A small glass vial containing a golden, viscous fluid that twitches on its own. \"The rich drank time like wine, believing it would keep their glass skins from growing dull. They did not know that hoarding time leaves none for the rest of the world. It tastes of copper and regret.\"",
        "category": "consumable",
        "effect": {
            "type": "heal",
            "value": 50
        },
        "icon": "vial"
    },
    "shard_of_panic": {
        "name": "Shard of Panic",
        "description": "A jagged splinter of red crystal that vibrates violently in the hand. \"Adrenaline crystallized into a solid state. Use it to borrow speed from your future self. Just remember that the debt must eventually be paid.\"",
        "category": "consumable",
        "effect": {
            "type": "speed_boost",
            "duration": 10,
            "value": 1.5
        },
        "icon": "shard_red"
    },
    "bottled_silence": {
        "name": "Bottled Silence",
        "description": "A heavy lead jar that seems to weigh nothing at all. Opening it releases a total absence of sound. \"Harvested from the deepest vaults of the Hushed Halls. For a moment, you do not exist, for existence is a vibration, and you have ceased to hum.\"",
        "category": "consumable",
        "effect": {
            "type": "stealth",
            "duration": 15
        },
        "icon": "jar_dark"
    },
    "stopped_watch": {
        "name": "The Stopped Watch",
        "description": "A heavy brass pocket watch with hands fused to the face at 11:59. \"A keepsake of the Chief Engineer. It is said he stared at this watch for so long he forgot to wind the heavy heart of the world. Or perhaps, he chose not to.\"",
        "category": "key",
        "effect": null,
        "icon": "watch"
    },
    "rusty_key_hand": {
        "name": "The Rusty Key-Hand",
        "description": "The severed hand of a disposal unit, joints fused by oxidation. Even in death, it clutches its charge with mechanical devotion. It opens the Maintenance Doors, which were sealed to keep the grinding noise of the undercity from reaching the glass gardens above.",
        "category": "key",
        "effect": {
            "type": "unlock",
            "target": "maintenance_doors"
        },
        "icon": "key"
    },
    "breath_of_creator": {
        "name": "Breath of the Creator",
        "description": "He gave his breath to make them beautiful, but he had no breath left to tell them they were fragile.",
        "category": "boss_soul",
        "effect": {
            "type": "unlock_spell",
            "spell": "glass_form"
        },
        "icon": "breath"
    },
    "tuning_fork_spear": {
        "name": "Tuning Fork Spear",
        "description": "A massive, two-pronged spear made of heavy, dull iron. It vibrates violently upon impact. \"Standard issue for the Silence Guard. While the glass nobility sought perfect pitch, the guards were tasked with 'dampening' dissonance—usually by skewering the source to stop its vibration. It does not cut; it shakes the target apart.\"",
        "category": "weapon",
        "effect": {
            "type": "equip",
            "damage": 40,
            "resonance_gain": 5
        },
        "icon": "sword"
    },
    "cracked_mirror": {
        "name": "A Cracked Mirror",
        "description": "The glass reflects the smog and the steel, but your face is absent. Only a hollow ache remains where your image should be. Proof that you are a ghost in this machine.",
        "category": "narrative",
        "effect": null,
        "icon": "mirror"
    },
    "foremans_ledger": {
        "name": "Foreman's Ledger",
        "description": "A log of 'Soft Units' marked for the furnace. The final entry is stamped 12:00:00, repeated until the ink ran dry. The exact second the world decided to stop breathing.",
        "category": "narrative",
        "effect": null,
        "icon": "book"
    },
    "oxidized_whistle": {
        "name": "Oxidized Whistle",
        "description": "A dog whistle made of rusted iron. It makes no sound when blown, but the rust on nearby metal begins to flake off. \"The scavengers used these to call the beast, feeding it scrap to keep it from eating them. It answers only to the song of decay.\"",
        "category": "key",
        "effect": {
            "type": "trigger_event",
            "event": "summon_rust_dragon"
        },
        "icon": "whistle"
    },
    "scale_of_decay": {
        "name": "Scale of Decay",
        "description": "A massive, flaking scale that smells of wet iron. It is warm to the touch. \"Entropy is not a mistake; it is the universe breathing out. This scale proves that even the end can be beautiful.\"",
        "category": "key",
        "effect": null,
        "icon": "scale"
    },
    "mannequin_eye": {
        "name": "Mannequin's Glass Eye",
        "description": "A perfectly spherical glass eye, weeping a constant stream of oil. \"The prototypes were discarded because they could not stop crying. The Architects deemed 'sorrow' a flaw in the manufacturing process, rather than a reasonable reaction to existence.\"",
        "category": "narrative",
        "effect": null,
        "icon": "eye"
    },
    "perfect_prism": {
        "name": "Perfect Prism",
        "description": "A geometric impossibility. A prism that reflects light that isn't there. \"Vitria demanded perfection. When this prism was cut, it was so flawless that it became jealous of its own reflection. It yearns to be broken.\"",
        "category": "key",
        "effect": {
            "type": "trigger_event",
            "event": "summon_mirror_knight"
        },
        "icon": "prism"
    },
    "shard_of_narcissus": {
        "name": "Shard of Narcissus",
        "description": "A mirror shard that shows the viewer's face, but older and wiser. \"Vanity freezes time. To love oneself is to refuse to change. To hold this shard is to accept that you are not who you were yesterday.\"",
        "category": "key",
        "effect": null,
        "icon": "shard"
    },
    "spring_of_eternity": {
        "name": "Spring of Eternity",
        "description": "A mainspring that never unwinds. It holds infinite tension. \"The machine wanted to run forever. It didn't understand that a song that never ends is just noise. This spring represents the courage to stop.\"",
        "category": "key",
        "effect": null,
        "icon": "spring"
    },
    "velvet_throat": {
        "name": "Velvet Throat",
        "description": "A fleshy, preserved vocal cord wrapped in silk. It hums a low, sad note. \"The voice of the void. It does not scream; it whispers the truth that the Conductor tried to hide: The song was always meant to end.\"",
        "category": "key",
        "effect": null,
        "icon": "flesh"
    },
    "gag_of_the_saint": {
        "name": "The Gag of the Saint",
        "description": "A strip of cloth woven from pure void. It absorbs all light around it. \"Used to silence the First Prophet who tried to warn the world about the Conductor. The monks sew their own mouths shut in imitation, terrified that speaking the truth will summon the Static.\"",
        "category": "narrative",
        "effect": null,
        "icon": "cloth"
    },
    "generals_log": {
        "name": "General's Log: Entry 404",
        "description": "'We locked the door not to keep them out, but to keep Him in. The Conductor's song... it doesn't end. It just gets louder.'",
        "category": "narrative",
        "effect": null,
        "icon": "scroll"
    },
    "sheet_music_fragment": {
        "name": "Sheet Music Fragment",
        "description": "A torn page of the score. The notes are written in blood and oil. It ends abruptly at the 13th measure.",
        "category": "narrative",
        "effect": null,
        "icon": "paper"
    },
    "calcified_tuning_peg": {
        "name": "Calcified Tuning Peg",
        "description": "A rusted iron peg, fused to a lump of bone. \"Before the Carillon, there were smaller instruments. They were discarded not because they were broken, but because they could not play the Conductor's new scale. This one still hums in the key of G-Minor.\"",
        "category": "narrative",
        "effect": null,
        "icon": "peg"
    },
    "glass_handkerchief": {
        "name": "Glass Handkerchief",
        "description": "A square of spun glass, impossibly thin and flexible. \"The nobility used these to wipe away tears. However, glass does not absorb moisture; it only smears it across the face. A cruel design for a people who were forbidden to be unhappy.\"",
        "category": "narrative",
        "effect": null,
        "icon": "cloth"
    },
    "punch_card_of_the_late": {
        "name": "Punch-Card of the Late",
        "description": "A brass card with a single error punched into the timeline. \"Worker Unit 734 missed a beat by 0.04 seconds. The error was logged, the unit was melted down, and the metal was reused to make this card. Efficiency is a circle.\"",
        "category": "narrative",
        "effect": null,
        "icon": "card"
    },
    "jar_of_stifled_laughter": {
        "name": "Jar of Stifled Laughter",
        "description": "A small, vacuum-sealed jar. It vibrates slightly. \"The Silent Choir believes that joy is the loudest noise of all. They captured this sound from a child before sewing his mouth shut. If you shake it, it sounds like weeping.\"",
        "category": "narrative",
        "effect": null,
        "icon": "jar_light"
    },
    "glitch_dust": {
        "name": "Glitch-Dust",
        "description": "A handful of white powder that flickers in and out of existence. \"Matter that cannot decide if it is real. Snorting it grants a brief vision of a world without crystal, where the sky is blue instead of white static. The user usually wakes up screaming.\"",
        "category": "narrative",
        "effect": null,
        "icon": "powder"
    }
}
